tests/mutations/join_key_swapped.patch
# kills: checked_merge join keys do not match frame.yaml joins
--- a/src/merge.py
+++ b/src/merge.py
@@ -38,7 +38,7 @@
         if right_key not in right_work.columns:
             raise ValueError(JOIN_KEYS_MISMATCH)
         right_work = right_work.rename(columns={right_key: keys[0]})
-    merge_keys = keys
+    merge_keys = ["video_id"]
     if merge_keys != list(spec["keys"]):
         raise ValueError(JOIN_KEYS_MISMATCH)
     overlap = (set(left.columns) & set(right_work.columns)) - set(merge_keys)
