tests/mutations/join_key_swapped.patch
# kills: checked_merge join keys do not match frame.yaml joins
--- a/src/merge.py
+++ b/src/merge.py
@@ -27,7 +27,7 @@
         raise ValueError(JOIN_NAME_MISSING)
     spec = joins[join_name]
     keys = list(spec["keys"])
-    merge_keys = keys
+    merge_keys = ["video_id"]
     if merge_keys != list(spec["keys"]):
         raise ValueError(JOIN_KEYS_MISMATCH)
     overlap = (set(left.columns) & set(right.columns)) - set(merge_keys)
