tests/mutations/join_key_swapped.patch
# kills: checked_merge syllables_windows: row count is not the declared expected count
--- a/src/joins.py
+++ b/src/joins.py
@@ -8,7 +8,7 @@
 
 JOIN_SPEC = {
     "syllables_windows": {
-        "on": ["uid"],
+        "on": ["video_id"],
         "expected_field": "syllables_expected",
     },
     "published_syllables_videos": {
