tests/mutations/stratum_seed_replaced_by_master.patch
# kills: per-stratum seed must equal int(sha256(master_seed:h)[:8], 16)
--- a/src/seeds.py
+++ b/src/seeds.py
@@ -11,8 +11,7 @@
 
 
 def stratum_seed(master_seed: int, h: str) -> int:
-    payload = f"{master_seed}:{h}".encode("utf-8")
-    return int(hashlib.sha256(payload).hexdigest()[:8], 16)
+    return int(master_seed)
 
 
 def assert_stratum_seeds(master_seed: int, seeds: dict[str, int]) -> None:
