tests/mutations/stratum_weights_ones.patch
# kills: stratum weights do not equal N_h divided by n_h_judgeable
--- a/src/weights.py
+++ b/src/weights.py
@@ -6,7 +6,7 @@ import numpy as np
 
 
 def stratum_weights(N_h: np.ndarray, n_h_judgeable: np.ndarray) -> np.ndarray:
-    return np.asarray(N_h, dtype=float) / np.asarray(n_h_judgeable, dtype=float)
+    return np.ones_like(np.asarray(N_h, dtype=float))
 
 
 def assert_stratum_weights(w: np.ndarray, N_h: np.ndarray, n_h_judgeable: np.ndarray) -> None:
